xmlcf/Documents/ПополнениеВыводСБрокерскогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПополнениеВыводСБрокерскогоСчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииПополнениеВыводСБрокерскогоСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаспоряжения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУдержанногоНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlcf/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходРасходДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlcf/Enums/ВидОперацииПополнениеВыводСБрокерскогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидОперацииПополнениеВыводСБрокерскогоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пополнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вывод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xmlcf/Documents/ПополнениеВыводСБрокерскогоСчета/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ВидОперации = Перечисления.ВидОперацииПополнениеВыводСБрокерскогоСчета.Пополнение тогда
		
		Движения.ОстаткиДенежныхСредств.Очистить();
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движения.Записать();
		
		// регистр ОстаткиДенежныхСредств Приход
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Валюта = Валюта;
		Движение.Портфель = Портфель;
		Движение.Сумма = Сумма;
		
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииПополнениеВыводСБрокерскогоСчета.Вывод тогда
		
		Движения.ОстаткиДенежныхСредств.Очистить();
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движения.Записать();
		
		//Контроль минусовых остатков пока отключен пока отключен, так как могут быть операции покупки валюты которые в этом документе не отражаются. минусы должны закрыться приобретением актива валюта
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
		//	|	ОстаткиДенежныхСредствОстатки.Портфель КАК Портфель,
		//	|	СУММА(ОстаткиДенежныхСредствОстатки.СуммаОстаток) КАК СуммаОстаток
		//	|ИЗ
		//	|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		//	|			&Период,
		//	|			Портфель = &Портфель
		//	|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ОстаткиДенежныхСредствОстатки.Валюта,
		//	|	ОстаткиДенежныхСредствОстатки.Портфель";
		//
		//Запрос.УстановитьПараметр("Валюта", Валюта);
		//Запрос.УстановитьПараметр("Период", Новый Граница(Ссылка,ВидГраницы.Исключая));
		//Запрос.УстановитьПараметр("Портфель", Портфель);
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//	Если ВыборкаДетальныеЗаписи.СуммаОстаток < Сумма + СуммаУдержанногоНалога тогда
		//		Отказ = Истина;
		//	Иначе
		//		// регистр ОстаткиДенежныхСредств Расход
		//		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		//		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//		Движение.Период = Дата;
		//		Движение.Валюта = Валюта;
		//		Движение.Портфель = Портфель;
		//		Движение.Сумма = Сумма + СуммаУдержанногоНалога;	
		//	КонецЕсли;
		//КонецЦикла;	
		
		//регистр ОстаткиДенежныхСредств Расход
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Валюта = Валюта;
		Движение.Портфель = Портфель;
		Движение.Сумма = Сумма + СуммаУдержанногоНалога;
		
	КонецЕсли;
	
КонецПроцедуры
